tutorials/ancientStuff/incompressible/wDissipationTempResidenceTauSimpleFoam/2019_07_30_dedicatedSolverW_simple_pipe/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
            volScalarFieldValue materials 1	//indicates non-fluid part of the mesh
            volScalarFieldValue DT 1.1e-5	//thermal diffusivity of 1.2738
);

regions
(
    surfaceToCell
	{      
    file			"fluidDomain1.stl";

	outsidePoints	((0.0639500021934509  0.00965638303631521 -0.0017900001257658));
	useSurfaceOrientation false;
	
	
	//enable one of the following five
	nearDistance 	-1;			//-1 means deactivated, otherwise: pick all cells within [value] m of geometry.stl
	includeInside	true;		// pick all cells entirely within the geometry.stl
	includeOutside	false;		// pick all cells entirely outside of geometry.stl
	includeCut		true;		// pick all cells intersected by geometry.stl
	curvature		-100;		//-100 means deactivated, combine this with nearDistance
			
        fieldValues
        (
            volScalarFieldValue materials 0	//indicates fluid part of the mesh
            volScalarFieldValue DT 1.6e-7	//thermal diffusivity of HPDE Hostalen GD9550F
        );
    }
    surfaceToCell
	{      
    file			"fluidDomain2.stl";

	outsidePoints	((0.0639500021934509  0.00965638303631521 -0.0017900001257658));
	useSurfaceOrientation false;
	
	
	//enable one of the following five
	nearDistance 	-1;			//-1 means deactivated, otherwise: pick all cells within [value] m of geometry.stl
	includeInside	true;		// pick all cells entirely within the geometry.stl
	includeOutside	false;		// pick all cells entirely outside of geometry.stl
	includeCut		true;		// pick all cells intersected by geometry.stl
	curvature		-100;		//-100 means deactivated, combine this with nearDistance
			
        fieldValues
        (
            volScalarFieldValue materials 0	//indicates fluid part of the mesh
            volScalarFieldValue DT 1.6e-7	//thermal diffusivity of HPDE Hostalen GD9550F
        );
    }

//	cylinderToCell
//	{
//	p1 (-0.3736000061035156 -0.6905956268310547 9.805275555760009)
//	p2 (-0.3736000061035156 -0.6905956268310547 18.805275555760009)
//	innerRadius
//	}
);

 

// *********************
